export default {
    "createTour": {
        "step1": "выбор<br/> даты",
        "step1Title": "Даты путешествия",
        "step1From": "Заезд",
        "step1Placeholder": "Дата",
        "step1To": "Отъезд",
        "step2": "состав участников",
        "step2label": "Участники поездки",
        "step2Title": "Состав участников",
        "step2Adults": "Взрослых",
        "step2Children": "Детей",
        "step3": "формат тура",
        "step3Title": "Формат тура",
        "step4": "выбор локаций",
        "step4Title": "Выбор локаций",
        "step5": "проверка заявки",
        "step5Title": "Проверка заявки",
        "step5Desc": "Даты поездки",
        "step5Desc2": "Состав участников",
        "step5Desc3": "Формат тура",
        "step5Desc4": "Локации",
        "step6": "отправка заявки",
        "step6Title": "Оставить заявку",
        "button": "Далее",
        "successTitle": "Спасибо! Ваша заявка отправлена",
        "successDesc": "мы свяжемся с вами в&nbsp;ближайшее время",
        "successLink": "На главную",
        "nextButton":"Далее",
        "prevButton":"Назад"
    },
    "close": "Закрыть",
    "notSpecified": "Не заданы",
    "locations": "Локации",
    "politic": "Политика конфиденциальности",
    "showTours": "Посмотреть туры",
    "contacts": "Контакты",
    "application": "Оставить заявку",
    "blog": "Блог",
    "blogAll": "Все статьи",
    "whoAreWe": "Кто мы",
    "buttonHome": "На главную",
    "home": {
        "activity": "Активности",
        "upcomingTours": "Ближайшие туры",
        "titlerQueue":"Нам доверяют",
				"advisorTitle": "О нас говорят"
    },
    "breadCrumbs": {
        "activities": "Активности",
        "blog": "Блог",
        "tour": "Туры",
        "faqEntry": "Правила въезда на Камчатку",
        "faqDress": "Как одеваться",
        "faqHowToGet": "Как добраться",
        "faqAreas": "Охраняемые территории",
        "faqSafety": "Советы по безопасности",
        "faqStay": "Где остановиться",
        "about": "Кто мы"
    },
    "tour": {
        "prev": "Предыдущий тур",
        "next": "Следующий тур",
        "interested": "Активности в туре",
        "request": "Запросить даты",
        "book": "Бронировать тур",
        "textBottomDatesTitle": "Вы получите качественный отдых без стресса",
        "textBottomDatesDesc": "И будете путешествовать с удовольствием. Мы позаботились об этом, сделав акцент на главном.",
        "stages": "Как будет проходить программа",
        "stageDay": "день",
        "locationsProgram": "Локации, включённые в программу:"
    },
    "activities": {
        "countText": " активностей"
    },
    "faq": {
        "title": "FAQ",
        "description": "В этом разделе мы разместили<br> ответы на самые частые вопросы<br> от туристов.",
        "collapse": "Свернуть",
        "answerQuestions": "Ответим на все ваши вопросы",
        "navOne": "вопрос-ответ",
        "navTwo": "правила въезда",
        "navThree": "как добраться",
        "navFour": "где остановиться",
        "navFife": "как одеваться",
        "navSix": "охраняемые территории",
        "navSeven": "советы по безопастности",
        "navEight": "бронирование и оплата",
        "infrastructure":"Инфраструктура",
        "attraction":"Достопримечательности"
    },
    "tours": {
        "title": "Туры",
        "createTour": "Создать свой тур",
        "more": "Подробнее",
        "hide": "Скрыть"
    },
    "search": {
        "search": "Поиск",
        "searchDesc": "Введите поисковой запрос",
        "searchNotFound": "По вашему запросу ничего не найдено",
        "searchFound": "Найдено: ",
        "searchResults": ""
    },
    "how-to-get-distance-1": {
        "important": "Важно!"
    },
    "feedback": {
        "titleForm": "Оставить заявку",
        "successForm": "Ваша заявка отправлена",
        "successForm2": "мы свяжемся с вами в ближайшее время",
        "required": "Обязательное поле",
        "empty": "Необходимо заполнить поле",
        "noValidPhone": "Не полностью заполнен номер",
        "noValidEmail": "Неверный формат почты",
        "name": "Имя",
        "phone": "Телефон",
        "city": "Город",
        "comment": "Комментарий",
        "attach": "Прикрепить резюме",
        "agreement": "Отправляя свои данные через эту форму, я принимаю условия",
        "agreementLink": "соглашения",
        "agreementBottom": "об обработке персональных данных",
        "send": "Отправить",
        "countPeople": 'Количество человек',
        "arrivalDate": 'Дата прибытия',
        "code": "Код",
        "button": "Связаться с нами"
    },
    "howToDress": {
        "title": "Как одеваться в поездку на Камчатку"
    },
    "howToDressFeaturesRegion": {
        "title": "Особенности региона",
        "desc" : "Прежде, чем начать упаковывать чемодан для поездки на Камчатку, следует учесть важную особенность этого региона - неустойчивую погоду.",
        "desc2" : "Погода на Камчатке, пожалуй, одна из самых непредсказуемых на Земле. В городе с утра редко когда можно с уверенностью определить, что день обещает быть ясным и солнечным. Скорее вы увидите туманную дымку, вслед за которой могут прийти как осадки, так и яркое солнце. В горах же погода порой меняется несколько раз в течение всего одного часа.",
        "desc3" : "Конечно, вам может повезти, и вы проведете все путешествие под палящими лучами северного солнца, а может повезти вдвойне, и вы увидите настоящую Камчатку с ее изменчивым настроением, открывающим все грани красоты этого места. Главное – быть к этому готовым."
    },
    "howToDresskamchatkaSummer": {
        "title": "Камчатское лето",
        "desc": "Лето на Камчатке – короткое, длится с июня по август. При этом в июне в горах еще очень много снега, так много, что обычно часть маршрута путешественники проходят по снежникам и грязевым площадкам, сформированным многочисленными ручейками, бегущими с тающих гор. С середины июля маршруты становятся более сухими, а в конце августа в горах выпадает свежий снег. Температура воздуха и сама погода разительно отличаются в различных районах Камчатки.",
        "desc2": "Безусловно, удовольствие от прогулки в горах Камчатки зависит от многих факторов, например, от вашей физической формы, от погодных условий, от сервиса сопровождающей команды, а так же не в последнюю, если не в первую очередь, от правильно подобранной одежды, которую можно было бы оперативно корректировать в условиях изменчивой погоды и физической нагрузки."
    },
    "howToDressClothes": {
        "recommendations": "Рассмотрим более подробно список рекомендуемой экипировки для поездки на Камчатку",
        "title": "Принцип многослойной одежды",
        "desc": "Поскольку мы хотим, чтобы в горах вам всегда было комфортно, тепло и сухо, при выборе одежды рекомендуем использовать принцип многослойной системы. Что это такое? Многослойная система экипировки предполагает использование нескольких различных типов одежды, каждый из которых выполняет свою важную функцию и дополняет другой: нательный влагоотводящий, ходовой влагоотводящий, утепляющий, ветро/влагозащитный, внешний утеплитель. Подробнее обо всех типах и их использовании:"
    },
    "howToDressAssistant": {
        "title": "Незаменимые помощники",
        "desc": "Часто люди не придают значения таким вещам как рюкзак и треккинговые палки. Однако на Камчатке – наличие этих вещей является обязательным, если вы хотите облегчить себе подъем в гору."
    },
    "howToDressFootwear": {
        "title": "Обувь",
        "desc": "Один из важнейших элементов вашей экипировки. Лучше, если у вас уже будет разношенная, проверенная треккинговая обувь. Если собрались покупать новую – испытайте ее и по максимуму разносите до поездки на Камчатку. Обувь не должна вам жать и доставлять дискомфорт, вам должно быть удобно в треккинговой обуви уже в магазине."
    },
    "howToDressAccessories": {
        "title": "Аксессуары",
        "desc": "Без которых здесь не обойтись и в летнее время года."
    },
    "howToDressNight": {
        "title": "Для ночевок в лагере",
        "desc": "Если планируются по заданному маршруту."
    },
    "howToDressImportant": {
        "title": "Важно!",
        "desc": "Такое снаряжение как: посуда для приема пищи, палатка и прочее общее снаряжение везти с собой не нужно (только из личных побуждений), поскольку все это мы предоставляем сами."
    },
    "howToGet": {
        "title": "How to get"
    },
    "upcoming-tours": {
        "title": "Ближайшие туры"
    },
    "pageNotFound": {
        "title": "Страница, которую вы искали — не найдена. Вернуться на",
        "link": "Главную",
        "metaTitle": "Страница не найдена. Камчатка",
        "metaDescription": "Вы находитесь на странице: '404 Страница не найдена'"
    },
    "buy-tickets": {
        "title": "Когда покупать билеты",
        "p1": "Приобретать билеты на Камчатку на летний сезон лучше всего заранее — за полгода минимум. В декабре-январе в продажу поступают билеты по самым низким тарифам. Зачастую билеты по акциям можно приобрести только на сайте самого перевозчика.",
        "p2": "Во время летнего сезона — июнь-начало сентября стоимость авиабилетов вырастает в 3-4 раза, а так же уменьшаются шансы приобрести билеты на большую компанию на одни и те же даты вылета."
    },
    "contactsPage": {
        "title": "Контакты",
        "heading": "Наш офис — там где мы. <br/> Все наши программы – индивидуальные."
    },

    "about-us": {
        "whoAreWe": "Кто мы",
        "aboutEnjoy": "Enjoy Kamchatka — это семейная компания. Поэтому мы – это Семён и София Махнаткины. Мы родились и живем на Камчатке.",
        "aboutEnjoy-p1": "Enjoy Kamchatka — единственная компания на Камчатке, специализирующаяся исключительно на организации индивидуальных путешествий.",
        "aboutEnjoy-p2": "У нас большие амбиции и сильная команда. Мы нацелены на результат и отвечаем за качество, а потому работаем только с лучшими. Наши проводники — действующие горные гиды, меню составляет шеф-повар успешного ресторана, а договорные условия по фрахту техники мы прописываем, учитывая все пожелания заказчика.",
        "aboutEnjoy-p3": " Мы не боимся сложностей и на практике доказали, что умеем оперативно решать любые задачи. Наша работа максимально прозрачна, поэтому мы легко демонстрируем сметную документацию путешествия и информируем о всех этапах планируемого проекта.",
        "whereWeLive": "Мы живем на родной земле и любим Камчатку",
        "whereWeLive-p1": "Мы работаем для вас с достоинством и истинным знанием своего дела. Мы собрали команду профессионалов, которые позаботятся о вас на протяжении всего вашего путешествия. Это люди, которые изо дня в день совершенствуют своё мастерство, будь то альпинизм либо серфинг.",
        "ourTeamTitle": "Познакомьтесь с нашей командой профессионалов",
        "ourAdvantages": "Наши преимущества"
    },
    "blogPage": {
        "header": "Блог",
        "all": "Все",
        "detalInfoBlog":"Подробнее"
    },

    "footer": {
        "timeTitle": "Сейчас <br> на Камчатке",
        "navOne": "Туры",
        "navTwo": "Активности",
        "navThree": "Кто мы",
        "navFour": "FAQ",
        "navFive": "Блог",
        "navSix": "Контакты",
        "sectionsTitle": "Разделы",
        "contactUsTitle": "Отправиться в путешествие",
        "contactNumberOne": "+7 924 780 44 11",
        "contactNumberTwo": "+7 924 780 44 11",
        "contactEmail": "info@enjoykamchatka.ru",
        "copyright": `© ${new Date().getFullYear()} Enjoy Kamchatka. <br/> Все права защищены. Копирование материалов<br/>без активной ссылки на источник запрещено.`,
        "copyrightRouting": `© ${new Date().getFullYear()} Enjoy Kamchatka. <br/> Все права защищены. Копирование материалов<br/>без активной ссылки на источник запрещено.`,
        "company": "Разработка и дизайн сайта.",
        "facebook": "Мы в Facebook",
        "instagram": "Мы в Instagram",
        "youtube": "Наш Youtube канал",
        "tripadvisor": "Отзывы о нас на TripAdvisor",
        "newYorkTimes": "The New York Times о нас",
        "firm": "Разработано <b>Digital lab</b>",
        "artLebedev": "Задизайнено <b>Студия Артемия Лебедева</b>",
    }
}
