// <template>
//     <div class="tripadvisor-reviews">
//         <div class="tripadvisor-reviews__container">
//             <div class="tripadvisor-reviews__title section-grid__title">
//                 О нас говорят
//             </div>
//             <div class="tripadvisor-reviews__slider">
//                 <div v-if="this.currentRouteName === 'ru'">
//                     <client-only>
//                         <vue-slick ref="reviewsSlider" :options="slickOptions">
//                             <template v-for="(review, key) in reviews.ru">
//                                 <tripadvisor-review
//                                     :key="`review-${key}`"
//                                     :reviewer="review.reviewer"
//                                     :avatar="review.avatar"
//                                     :title="review.title"
//                                     :date="review.date"
//                                     :text="review.text"
//                                 />
//                             </template>
//                         </vue-slick>
//                     </client-only>
//                 </div>
//                 <div v-else>
//                     <client-only>
//                         <vue-slick ref="reviewsSlider" :options="slickOptions">
//                             <template v-for="(review, key) in reviews.en">
//                                 <tripadvisor-review
//                                     :key="`review-${key}`"
//                                     :reviewer="review.reviewer"
//                                     :avatar="review.avatar"
//                                     :title="review.title"
//                                     :date="review.date"
//                                     :text="review.text"
//                                 />
//                             </template>
//                         </vue-slick>
//                     </client-only>
//                 </div>
//             </div>
//             <div class="slider-review-arrows">
//                 <button class="icon-arrow icon-arrow-left" @click="prevSlide"></button>
//                 <button class="icon-arrow icon-arrow-right" @click="nextSlide"></button>
//             </div>

//             <a href="https://www.tripadvisor.ru/Attraction_Review-g298492-d13277122-Reviews-Enjoy_Kamchatka-Petropavlovsk_Kamchatsky_Kamchatka_Krai_Far_Eastern_District.html#tab-data-WebPresentation_PoiReviewsAndQAWeb"
//                target="_blank" class="tripadvisor-reviews__link">
//                 Все отзывы c Tripadvisor
//             </a>
//         </div>
//     </div>
// </template>

// <script>
// import TripadvisorReview from "./TripadvisorReview";

// export default {
//     name: "TripadvisorReviews",
//     components: {
//         TripadvisorReview,
//     },
//     computed: {
//         currentRouteName() {
//             return this.$store.$i18n.loadedLanguages[0];
//         },
//     },
//     data: () => ({
//         slickOptions: {
//             arrows: false,
//             slidesToShow: 2,
//             responsive: [
//                 {
//                     breakpoint: 1279,
//                     settings: {
//                         slidesToShow: 1,
//                     }
//                 },
//             ]
//         },
//         reviews: {
//             ru: [
//                 {
//                     reviewer: 'Оксана',
//                     avatar: '1.png',
//                     date: 'авг. 2022 г.',
//                     title: 'Камчатка: люди и природа - все на отлично!',
//                     text: 'В 2022 году решили не откладывать мечту и побывать на Камчатке.<br/>' +
//                         'Сразу было понятно, что организовать путешествие самостоятельно не получится. Общались с несколькими туроператорами, не слишком понимая, чего именно мы хотим. Потом решили поискать местного туроператора. Да, коммуникации с такой разницей во времени не очень просты, но!<br/>' +
//                         'Сразу стало понятно, что Софья, с которой мы вели переписку, дает самые конкретные и точные рекомендации. В результате – мы купили тур у Enjoy Kamchatka. То, насколько это был верный выбор, мы в полной мере поняли только на Камчатке!<br/>' +
//                         'Если бы все так выполняли свою работу!<br/>' +
//                         'Мы ежедневно получали все необходимое с организационной точки зрения, и даже больше.<br/>' +
//                         'Мы, по привычке, пытались сами немного подруливать планами..<br/>' +
//                         'Быстро стало понятно, что не надо мешать профессионалам делать свою работу. Софья, Анастасия, Семен – им можно полностью доверять организацию своего отдыха!<br/>' +
//                         'Да, нам невероятно повезло с погодой. За 12 дней ни одного дождя, температура от 18 до 24, насекомых – ноль!<br/>' +
//                         'Природа и люди, которые нам встретились! Это неизгладимые воспоминания.<br/>' +
//                         'И есть в моей жизни много мест, где побывав, сохраняешь уйму впечатлений, но не думаешь о том, что хорошо бы вернуться ..<br/>' +
//                         'А мысли о Камчатке не отпускают. Скажу больше, теперь я хотела бы там побывать даже больше, чем когда только собиралась впервые. Спасибо, Enjoy Kamchatka!'
//                 },
//                 {
//                     reviewer: 'Евгения С',
//                     avatar: '3.png',
//                     date: 'июль 2022 г. • Семейный отдых',
//                     title: 'Камчатка - другой мир!',
//                     text: 'Отдыхали на Камчатке с 25 июля по 2 августа. Наш отдых полностью организовали Enjoy Kamchatka. От отеля до развлечений. Очень удобно. Нам оставалось только получать удовольствие! Организовать самостоятельно отдых в этом месте невозможно. Камчатка непредсказуема по погоде, а значит планы меняются со скоростью света. Ребята взяли этот вопрос на себя. У нас не было запасных дней, чтобы переждать непогоду, поэтому сами мы точно не смогли бы посмотреть всё, что посмотрели. За 8 дней активной программы мы посмотрели больше, чем можно вместить. Прошёл почти месяц, а я до сих пор не верю, не могу осознать этот отдых. Невероятная природа, крутейшие виды!<br/>' +
//                         'Благодаря тому, что наш отдых организовывали профессионалы, мы смогли побывать везде с четырёхлетним ребёнком. Я бы ни за что не решилась идти на вулкан с малышом, но с нами было два гида, один из которых вёл сына, рассказывал истории и отвлекал от усталости.<br/>' +
//                         'Очень рекомендую Enjoy Kamchatka тем, кто хочет отдохнуть на Камчатке с комфортом и привезти из поездки только положительные эмоции и восхитительные впечатления!<br/>' +
//                         'Спасибо Кириллу, Борису, Александру, Алексею, надеюсь ещё встретимся! София, Анастасия, спасибо за «руку на пульсе»!'
//                 },
//                 {
//                     reviewer: 'karelira@ya.ru',
//                     avatar: '2.png',
//                     date: 'авг. 2022 г. • С друзьями',
//                     title: 'Камчатка-затеряный мир',
//                     text: 'Отдыхали на Камчатке с 12 по 24 августа 2021 года,понравилось все-природа, люди, еда.Наше путешествие организовало Enjoy Kamchatka. Несмотря на обьективные и субьективные проблемы, мы выполнили все свои планы.София и Анастасия совершили невозможное. Спасибо вам за этот незабываемый отдых. Отдельное спасибо Антону , который показал нам самые красивые места Камчатки , и Михаилу,он кормил нас великолепно приготовленной едой.Невозможно передать словами как все было замечательно.Enjoy Kamchatka -это группа единомышленников-профессионалов.Когда мы в следующий раз соберемся на Камчатку, мы снова обратимся только туда.Спасибо большое.'
//                 },
//                 {
//                     reviewer: 'Сергей Б',
//                     avatar: '4.png',
//                     date: 'июль 2022 г.',
//                     title: 'Пожалуй, самое грандиозное приключение в жизни',
//                     text: 'Делюсь впечатлениями о путешествии семьи (двое взрослых и двое детей 13 и 7 лет) из провинции (Ярославская область) на Камчатский полуостров. Поездку планировали долго и продумывали каждый шаг. В результате проработки поняли, что для организации поездки в столь отдалённых край целесообразно привлечь местного туроператора. Изучив ассортимент и отзывы, остановились на компании Enjoy Kamchatka. И не ошиблись с выбором...<br/>' +
//                         'Компания специализируется на организации индивидуальных туров с предоставлением максимального уровня комфорта. Это очень актуально для тех, кто хочет путешествовать "только со своими" и для семей с детьми. В феврале списались с представителем туроператора, озвучили свои пожелания по срокам поездки, насыщению программы, проживанию и бюджету. Затем было несколько итераций по согласованию программы и стоимости. В апреле заключили договор, банковским переводом оплатили аванс, в июне перевели оставшуюся сумму. В июле полетели на Камчатку навстречу давней мечте.<br/>' +
//                         'Девять дней отпуска на Краю Света были очень насыщены на впечатления и комфортны по условиям. Побывали в Долине Гейзеров и на Курильском озере, вскарабкались на Мутновский вулкан, прокатились на собачьей упряжке, запряжённой чемпионами "Берингии", поймали камбалу на морской рыбалке и гольца на речной, ночевали на берегу Тихого океана. Очень впечатлили флора и фауна Камчатки, ведь полуостров это одновременно и зоопарк и дендрарий под открытым небом. Так что без преувеличения могу сказать, что эта поездка оставила самые неизгладимые впечатления в истории нашей семьи. За это хотим поблагодарить коллектив компании Enjoy Kamchatka, стараниями которых всё запланированное было реализовано.<br/>' +
//                         'В заключение отзыва хочу отметить несколько моментов, отличающих туроператора:<br/>' +
//                         '1) на период путешествия за нами был закреплён куратор, который встретил нас в гостинице, подробно объяснил программу и проверил нашу экипировку и готовность к активной части тура;<br/>' +
//                         '2) куратор подробно и своевременно информировал обо всех нюансах программы через чат в Whatsapp;<br/>' +
//                         '3) команда оператора оперативно и положительно реагировала на все запросы, пожелания, и даже капризы туристов (без требования дополнительной оплаты);<br/>' +
//                         '4) гиды оператора поразили своей эрудированностью и знаниями по всем вопросам, полученным от наших "почемучек";<br/>' +
//                         '5) при заселении в гостиницу в номере нас ждали "камчатские подарки" от оператора, и это был мощный позитивный импульс на предстоящие приключения.'
//                 },
//                 {
//                     reviewer: 'Anastasia S',
//                     avatar: '5.png',
//                     date: 'июль 2022 г. • Семейный отдых',
//                     title: 'Это классное место - Камчатка!',
//                     text: 'Наше путешествие на Камчатку состоялось в середине июля 2021 года благодаря отличной работе команды Enjoy Kamchatka.<br/>' +
//                         'Если Вы хотите удивить себя путешествием и испытать одно из самых ярких впечатлений в жизни, то Вам дорога на этот волшебный полуостров. Ну, а чтобы Вам было по-настоящему уютно и комфортно в этой дикой, необузданной, манящей природе, Вам следует обратиться в Enjoy Kamchatka!!! Такого профессионализма, отдачи и трепетного отношения мы не испытывали давно. Команда компании решает все важные вопросы оперативно, продуктивно и в интересах клиентов! Спасибо сотрудникам Enjoy Kamchatka за впечатления, которые останутся с нами на всю жизнь!'
//                 },
//                 {
//                     reviewer: 'Алексей',
//                     avatar: '6.png',
//                     date: 'май 2022 г. • Для двоих',
//                     title: 'Профессиональная команда EnjoyKamchatka оправдала ожидания',
//                     text: 'Добрый день.<br/>' +
//                         'На самом деле редко пишу отзывы, но в данном случае сделаю это, так как надеюсь, что отравная связь будет полезна для развития компании.<br/>' +
//                         'Что понравилось:<br/>' +
//                         '1. Слаженная организация на всех этапах пребывания на Камчатке от встречи по прибытии, раннего размещения, решения текущих вопросов до трансфера в аэропорт при вылете. Работа организаторов проходила незаметно для нас, что ещё раз подтверждает ее уровень;<br/>' +
//                         '2. Оперативное управление программой в зависимости от изменчивой Камчатской погоды, что позволило организовать каждую экскурсию в идеально подходящих погодных условиях;<br/>' +
//                         '3. Профессиональные и личностные качества горных гидов. В ходе экскурсий узнали информацию о проф.подготовке гидов, были приятно удивлены уровнем. Конечно, только профессионалы самого высокого уровня могут обеспечить безопасность на горном маршруте (пусть и несложном для людей посвящённых в тонкости, но мы к ним не относимся) и комфортное пребывание на самом маршруте. За ощущение безопасности и комфорта, профессионализм «горной» команды отдельное спасибо.<br/>' +
//                         'На что следует обратить внимание:<br/>' +
//                         '1. Оперативность обратной связи на этапе подготовки и согласования программы тура. Принимаю во внимание и учитываю разницу во времени. Но на этапе подготовки программы и согласования тура хотелось бы, что сотрудники отдела продаж отвечали оперативно в течение рабочего дня по Камчатскому времени. Это позволяет клиенту чувствовать его важность для компании.<br/>' +
//                         'Резюме:<br/>' +
//                         'Компания предоставляет услуги соответсвующие завяленной стоимости.<br/>' +
//                         'Сотрудники вовлечены в процесс сопровождения и оказания услуг, что позволяет превосходить эмоциональные ожидания клиента.<br/>' +
//                         'Рекомендую пользоваться услугами данной компании.<br/>' +
//                         'Благодарю Семена, Софью, а так же всю команду EnjoyKamchatka за прекрасно организованный отдых на земле Камчатки!'
//                 },
//                 {
//                     reviewer: 'Андрей Т',
//                     avatar: '7.png',
//                     date: 'май 2022 г.',
//                     title: 'Камчатка на майские',
//                     text: 'Благодарим команду Enjoy Kamchatka и, отдельно, руководство в лице Семена и Софии за первоклассную организацию нашего отдыха!<br/>' +
//                         '<br/>' +
//                         'Все было настолько организовано, качественно, продумано и проработано, что мы смогли просто расслабиться и насладиться столь прекрасной и незабываемой природой.<br/>' +
//                         'Даже с учетом того, что мы путешествовали с тремя детьми, и в период межсезонья, все мероприятия были подобраны так, что у всех остались исключительно позитивные и приятные впечатления, дети "пищали" от восторга, никто не устал, не боялся, не напрягался. Отдых прошел "на ура" и " на одном дыхании".<br/>' +
//                         'Отдельное Вам спасибо за терпеливый учет и внимательную реализацию всех нашими пожеланий, за помощь в решении нестандартных ситуаций, за нужные советы, в тех местах, где где это было необходимо.<br/>' +
//                         'Если будет возможность обязательно приедем к Вам еще и попросим организовать показ того, что не успели посмотреть в этот раз!<br/>' +
//                         'Всем рекомендуем!<br/>' +
//                         'Молодцы!'
//                 },
//                 {
//                     reviewer: 'Evgenia Z',
//                     avatar: '8.png',
//                     date: 'май 2022 г.',
//                     title: 'Идеально',
//                     text: 'Супер отпуск, организация и сервис на самом высоком уровне! Мы не думали ни о чем. За 4 дня нам показали столько всего (!), кормили местной свежей и вкусной едой! Все очень душевно, информативно, весело и захватывающе! Приедем еще и обязательно с детьми!'
//                 },
//                 {
//                     reviewer: 'Диляра Х',
//                     avatar: '9.png',
//                     date: 'май 2022 г. • С друзьями',
//                     title: 'Неравнодушная команда',
//                     text: 'Ребята, которые любят свое дело и любят гостей. Сделали все, чтобы Камчатка оставила неизгладимое впечатление'
//                 },
//             ],
//             en: [
//                 {
//                     reviewer: 'alex s',
//                     avatar: '10.png',
//                     date: 'июль 2022 г. • С друзьями',
//                     title: 'Fantastic trip on all fronts',
//                     text: 'We were a group of 12, including children (youngest 9 yo). Enjoy Kamchatka not only provided excellent service on all fronts, but also catered to all of our diverse and sometimes quite difficult requests and wishes.<br/>' +
//                         'In just over a week we saw and did it all - Kluchevskaya Sopka (which we only reached on the second attempt), Kuril Islands, bears, fishing, lakes, mountains, active volcanos, boat trip, hikes and many many more.<br/>' +
//                         'Truly unforgettable experience, all to highest standards.<br/>' +
//                         'This trip only strengthened my view that Kamchatka is one of the most amazing destinations in the world.<br/>' +
//                         'No hesitation whatsoever to recommend Enjoy Kamchatka.<br/>' +
//                         'Semen and Sophia, Thank you for the wonderful experience!'
//                 },
//             ]
//         },
//     }),
//     methods: {
//         nextSlide() {
//             this.$refs.reviewsSlider.next();
//         },

//         prevSlide() {
//             this.$refs.reviewsSlider.prev();
//         },
//     }
// }
// </script>

// <style lang="scss" scoped>
// @import "~@/assets/scss/mixins";
// @import "~@/assets/scss/config";

// .tripadvisor-reviews {
//     background: #21232a;
//     color: #ffffff;
//     min-height: calc(100vh - 100px);
//     display: flex;
//     align-items: center;
//     padding: 64px 0;

//     .tripadvisor-reviews__container {
//         padding: 0 65px;
//         width: 100%;
//         @include respond-to(sm) {
//             padding: 0 20px;
//         }
//     }

//     .tripadvisor-reviews__slider {
//         margin: 64px 0 32px;
//         min-height: 362px;
//     }

//     .tripadvisor-reviews__link {
//         color: #ffffff;
//         border-bottom: 0.05em solid;
//         font-size: 24px;
//         @include respond-to(sm) {
//             font-size: 20px;

//         }
//     }

//     /deep/ .slick-slide {
//         max-width: 100%;
//         width: 100%;
//     }

//     .slider-review-arrows {
//         width: 266px;
//         display: flex;
//         justify-content: space-between;
//         margin-bottom: 32px;
//         @include respond-to(lg) {
//             width: 220px;
//         }
//         @include respond-to(sm) {
//             width: 120px;
//         }
//     }

//     .icon-arrow {
//         background: url("~assets/img/menu/icons/strelki/r-w.png") no-repeat;
//         display: inline-block;
//         vertical-align: text-top;
//         background-size: contain;
//         width: 70px;
//         height: 70px;
//         outline: none;
//         border: 0;
//         @include respond-to(lg) {
//             width: 60px;
//             height: 60px;
//         }
//         @include respond-to(sm) {
//             width: 30px;
//             height: 30px;
//         }

//         &::before {
//             content: "";
//         }

//         &:hover {
//             background-image: url("~assets/img/menu/icons/strelki/r-b.png");
//             background-position: 0 1px;
//             @include respond-to(sm) {
//                 background-position: 0 0;
//             }
//         }

//         &-left {
//             transform: rotate(180deg);
//         }
//     }
// }
// </style>
